# 1. Pandas _ DataFramem 생성, 선택
# 2. Pandas _ DataFramem 조작하기

In [1]:
import numpy as np
import pandas as pd

## 1. Dataframe 생성

In [3]:
kor = [80, 90, 70, 30]                  # 리스트
eng = np.array([90, 70, 60, 40])        # 어레이
math = (90, 60, 80, 70)                 # 튜플

In [6]:
df = pd.DataFrame({
    '국어':kor, '영어':eng, '수학':math
}, index = ['춘향', '몽룡', '향단','방자'])
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [12]:
# 또다른 방법
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(40,101,12).reshape(4,3),
    columns = ['국어', '영어', '수학'], index=['춘향', '몽룡', '향단', '방자'])

df2

    국어  영어  수학
춘향  92  61  97
몽룡  40  85  70
향단  62  84  67
방자  69  61  69

## 2. 인덱싱

In [16]:
df['국어']['춘향'], df.국어['춘향'], df.국어[0], df['국어'][0], df.국어.춘향
# 취향 정하기 나는 컬럼은 .이름으로 인덱스는 브라켓으로 쓸거야.

(80, 80, 80, 80, 80)

In [17]:
df.국어

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

In [18]:
df.영어[1:3]

몽룡    70
향단    60
Name: 영어, dtype: int32

In [20]:
#데사스쿨 연습문제 4.1.3

# 1) 모든 수학점수 시리즈
df.수학
# 2) 모든 학생의 국어, 영어 점수를 데이터 프레임으로 
df[['국어', '영어']]
# 3모든 학생의 각 과목 평균 점수를 새로운 열로 추가
df['평균'] = df.mean(axis=1)

In [23]:
# 1 
df.수학

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [24]:
# 2 
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [25]:
# 3모든 학생의 각 과목 평균 점수를 새로운 열로 추가
df['평균'] = df.mean(axis=1)
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [27]:
# 4. 방자의 영어점수를 80점으로 수정, 평균점수도 다시 계산
df.영어['방자'] = 80
df.영어.방자 = 80 #미친..이게 가능해????
df.평균=df.mean(axis=1)
df

<ipython-input-27-ddc820984f3c>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.영어['방자'] = 80

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  56.666667

In [29]:
# 5. 춘향의 점수를 데이터 프레임으로 나타낸다. 
df[0:1]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

In [35]:
df[['국어','영어','수학','평균']][:1]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

In [31]:
df.iloc[:1, :-1]

    국어  영어  수학
춘향  80  90  90

In [39]:
# 6. 향단의 점수를 시리즈로 나타낸다.

# Series['향단']
df.loc['향단']   # 그러나 교재에서는 아직 loc,  iloc배우기 전이다.
                # 또한 iloc는 넘파이의 어레이처럼 인덱싱 하는것으로 행 , 열 순서 이다. 판다스 데이터프레임 인덱싱은 컬럼, 행 순이다

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [40]:
df.T   #트랜스 포즈

           춘향         몽룡    향단         방자
국어  80.000000  90.000000  70.0  30.000000
영어  90.000000  70.000000  60.0  80.000000
수학  90.000000  60.000000  80.0  70.000000
평균  86.666667  73.333333  70.0  56.666667

In [41]:
# 평균열 삭제
del df['평균']
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [42]:
# 영어, 수학 점수를 삭제
df2

    국어  영어  수학
춘향  92  61  97
몽룡  40  85  70
향단  62  84  67
방자  69  61  69

In [43]:
df3=df2[['국어']]
df3

    국어
춘향  92
몽룡  40
향단  62
방자  69

In [ ]:
# 세련되게 하자 좀. drop 메서드 #삭제 방법
# df에서는 원본이 변형되는 자기 파괴적 메서드를 사용하고 싶을때 대부분 뒤에 옵션을 줘야해
# 자기 자신을 변화시키는 옵션 inplace=True  디폴트는 폴스
df2.drop(columns = ['영어','수학'], inplace=True)
df2                             # 두번 실행하니 에러 ㄱㄱㄱ

In [49]:
df2

    국어
춘향  92
몽룡  40
향단  62
방자  69

In [ ]:
# 현재 CRUD 설명중 그런데 R 중에 리트라이브 맞나?

# 행삭제 비교적 편하다. 

df2.drop(['방자'], inplace=True)
df2

In [56]:
# 방자야 사라져라뎃.!  inplace=True 주기
df2

    국어
춘향  92
몽룡  40
향단  62

### 필터링 셀렉션 할 수 있어야되 참고페이지 어디?
##### csv 설명 28p 중

In [ ]:
# 인덱싱 loc, iloc
# loc는 인덱싱 그대로 쓸 수 있지만, 순서가 바뀌어 [] 브라켓 쓰지 않아도 되.
# iloc 인덱시이 쓰는 순간 넘파이 인덱싱 쓸 수 있어. 못할게 없어.

In [59]:
## df.copy = df 혹시 몰라서.
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [69]:
# 춘향, 몽룡의 영어 수학 점수
# df.loc['춘향':'몽룡', '영어':'수학']  # 맞는 버전 아니야
df.loc['춘향':'몽룡', '영어':]

    영어  수학
춘향  90  90
몽룡  70  60

In [70]:
# 몽룡, 향단의 영어 , 수학 점수 # loc버전 연습 및 실습에서는 iloc쓰자
df.iloc[1:3, 1:]

    영어  수학
몽룡  70  60
향단  60  80

In [61]:
# 몽룡, 향단의 국어, 수학 점수
df.iloc[1:3, ::2]

    국어  수학
몽룡  90  60
향단  70  80

### e데이터 프레임의 조작 #다음 파일로

## 3. 데이터프레임 데이터 조작

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [3]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# 타이타닉 info 결측치 볼것

In [4]:
# 기초 통계
# titanic.describe()

In [ ]:
# 눈으로만 보면 큰일나는 앤스콤 데이터 셋. 평균, 표준편자, y평균, y표준편차 상관계수까지 똑같아. 
# 숫자로만 보면 큰일나는 데이터 

# 산포도 확인해야 정확해. 엔스콤 데이터셋 각각의 데이터 다름에도 클래스별 통계값 다 같아.
# 그림으로 (산포도 등) 확인해야 정확함
ans = sns.load_dataset('anscombe')
# ans.head()
# ans.describe()
ans.groupby('dataset').describe()

* 산술메소드

In [11]:
np.random.seed(2021)
df = pd.DataFrame(np.random.randint(40,101,20).reshape(4,5),
                index=list('wxyz'), columns=list('ABCDE'))
df

    A   B   C   D   E
w  92  61  97  40  85
x  70  62  84  67  69
y  61  69  64  52  94
z  46  78  46  73  77

In [16]:
# axis = 0 디폴트
df.sum()
# df.sum(axis=1)

A    269
B    270
C    291
D    232
E    325
dtype: int64

In [17]:
df.sum(axis=1)

w    375
x    352
y    340
z    320
dtype: int64

In [18]:
# 넘파이 섬() 메서드 전체의 합
df.values.sum()

1387

In [22]:
# axis = 0 디폴트 axis = 1 도 가능
df.mean()
df.mean(axis=1)

w    75.0
x    70.4
y    68.0
z    64.0
dtype: float64

In [23]:
df['평균'] = df.mean(axis=1)
df

    A   B   C   D   E    평균
w  92  61  97  40  85  75.0
x  70  62  84  67  69  70.4
y  61  69  64  52  94  68.0
z  46  78  46  73  77  64.0

* 결측치 처리

In [24]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [25]:
# 타이타닉 이즈나 썸썸
titanic.isna().sum().sum()

869

In [26]:
# 어느 열에서 결측치가 있는지 확인
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [27]:
# 대체하는 방법 - 카테고리 형일 경우에는 최빈값(가장 빈도가 많은 값) #밸류 카운트 
titanic.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [30]:
titanic.embark_town = titanic.embark_town.fillna('Southhampton')
# titanic.embarked = titanic.embarked.fillna('S')
titanic.embarked.isna().sum()

0

In [32]:
# age값을 평균으로 대체
# 숫자는 평균 - 중앙값으로 

# titanic.age = titanic.age.mean()  내가 썻는데. fillna안씀 차이 뭐야?
titanic.age.fillna(titanic.age.mean(), inplace=True)
titanic.age.isna().sum()

0

In [34]:
# 너무 많은 결측치 있는 deck 필드 삭제 

# 1트 ,    titanic.dropna(axis=1)
# 위경우는 deck가 사라지지 않아. 않되! 
# 드랍나는 결측치 있는 행을 날리는 것이기에. 결측치 많은 컬럼을 드랍할때는 아래

# 2트 쌤과함께 
titanic.drop(columns=['deck'],inplace=True)
titanic
# titanic.isna().sum().sum()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

dropna( ) : NA 제거 함수
how (NA 삭제 방법) : 'any', 'all'
axis (적용 축) : 0(행), 1(열) 
thresh (NA가 아닌 개수) = 숫자(int) 
 

df.dropna(how='any', thresh = 0.8, axis = 1)

 

df.dropna(axis=0,df.dropna(axis=0,df.dropna(axis=0,

* *

In [36]:
# drop 과 dropna

# 행을 삭제할때에는 dropna써서 없애주고,  컬럼삭제할때에는 drop[컬럼명] 주어 삭제하는게 좋다.

titanic.dropna(inplace=True)  # axis=0 생략되. 디폴트가 0
titanic.shape

(891, 14)

* 데이터 타입 변경 , 데이터 조작 (결측치 처리는 위에서 끝)

In [37]:
# astype # 데이터 타입을 변경 # age 실수 - > 정수
titanic.age.astype(int)
# titanic.age

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888    29
889    26
890    32
Name: age, Length: 891, dtype: int32

In [39]:
df

    A   B   C   D   E    평균
w  92  61  97  40  85  75.0
x  70  62  84  67  69  70.4
y  61  69  64  52  94  68.0
z  46  78  46  73  77  64.0

In [41]:
df.평균 = df.평균.astype(int) # 평균 타입 정수 변경
df

    A   B   C   D   E  평균
w  92  61  97  40  85  75
x  70  62  84  67  69  70
y  61  69  64  52  94  68
z  46  78  46  73  77  64

* 어플라이 메소드 map과 비슷
* apply 메소드

In [53]:
#  행이나 열단위로 더 복잡한 처리를 할 경우

# df3.apply(lambda x: x.max() - x.min())
# df3.apply(lambda x: x.max() - x.min(), axis=1) # 행에 대해 적용

In [42]:
df3 = pd.DataFrame({
 'A': [1, 3, 4, 3, 4],
 'B': [2, 3, 1, 2, 3],
 'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [43]:
# 싫어하는 버전
def func1(x):
    return x.max() - x.min()

In [44]:
df3.apply(func1)

A    3
B    2
C    4
dtype: int64

In [45]:
# 파이써닉
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [46]:
# 행단위로 하고자 할 경우에는 axis=1 옵션 주기
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [47]:
#그나저나 왜 astype(int) 작동 안하나?/???
# 최대값에서 최소값 뺀 편차 (각 행별로) '편차'라는 이름의 열로 만든다
df['편차'] = df.apply(lambda x: x.max() - x.min(), axis=1)
df

    A   B   C   D   E  평균  편차
w  92  61  97  40  85  75  57
x  70  62  84  67  69  70  22
y  61  69  64  52  94  68  42
z  46  78  46  73  77  64  32

In [48]:
# 타이타닉 호의 승객 중에 나이 20살을 기준으로 성인과 미성년자를 구별하는 라벨 열을 만들때 .. 이거 nope
# 수업버전. 평균이 70점 이상이면 PASS, 아니면 FAIL인 결과 열을 추가할것

df['결과'] = df.평균.apply(lambda x : 'PASS' if x >=70 else 'FAIL')
df

    A   B   C   D   E  평균  편차    결과
w  92  61  97  40  85  75  57  PASS
x  70  62  84  67  69  70  22  PASS
y  61  69  64  52  94  68  42  FAIL
z  46  78  46  73  77  64  32  FAIL

In [49]:
# 파이써닉한 코드 람다버전 100점 
df['결과2'] = df.apply(lambda x : '합격' if x.평균 >=70 else '불합격', axis=1)
df

    A   B   C   D   E  평균  편차    결과  결과2
w  92  61  97  40  85  75  57  PASS   합격
x  70  62  84  67  69  70  22  PASS   합격
y  61  69  64  52  94  68  42  FAIL  불합격
z  46  78  46  73  77  64  32  FAIL  불합격

In [50]:
# 40점 코드
def func2(x):
    if x.평균 >= 70:
        return '합격'
    else:
        return '불합격'

In [51]:
# 50점 코드
def func3(x):
    if x.평균 >= 70:
        return '합격'
    return '불합격'

In [52]:
# 실행 해보기
# df.apply(func2())
df.apply(func2, axis=1)

w     합격
x     합격
y    불합격
z    불합격
dtype: object

In [53]:
df.apply(func3, axis=1)

w     합격
x     합격
y    불합격
z    불합격
dtype: object

In [54]:
def fuc4(x):
    return '합격' if x.평균 >= 70 else '불합격'    
# 람다버전 100점

*  1000단위 구분기호 없애기

In [56]:
# 1000단위 구분기호 없애기 
np.random.seed(2021)
# df = pd.DataFrame(np.random.randint(100,1000,12).reshape(3,4)*100, columns=list('ABCD'))
price_list=[]
for i in range(12):
    price = np.random.randint(100,1000,1)[0]*100
    price_list.append(f'{price:,d}')
price_list

['21,600',
 '44,100',
 '15,700',
 '22,800',
 '72,100',
 '96,200',
 '14,400',
 '61,100',
 '93,000',
 '76,900',
 '63,300',
 '44,900']

In [67]:
df = pd.DataFrame(np.array(price_list).reshape(3,4), columns=list('ABCD'))
df

        A       B       C       D
0  21,600  44,100  15,700  22,800
1  72,100  96,200  14,400  61,100
2  93,000  76,900  63,300  44,900

In [58]:
price = '125,000'
int(price.replace(',',''))

125000

In [ ]:
# df.apply(lambda x : x.replace(',',''))

In [66]:
df.A = df.A.apply(lambda x : int(x.replace(',','')))                          # 한줄에 대한 어플라이
df.A

0    21600
1    72100
2    93000
Name: A, dtype: int64

In [68]:
for column in df.columns:
    df[column] = df[column].apply(lambda x: int(x.replace(',','')))
df

       A      B      C      D
0  21600  44100  15700  22800
1  72100  96200  14400  61100
2  93000  76900  63300  44900

In [69]:
cctv = pd.read_csv('서울시CCTV설치운영현황(자치구)_년도별_210731기준.csv', 
                    skiprows=1, encoding='euc-kr')
cctv.head()

,구분,총계,2012년 이전,2012년,2013년,2014년,2015년,2016년,2017년,2018년,2019년,2020년,2021년
0,계,"77,032","7,667","2,200","3,491","4,439","6,582","8,129","9,947","9,876","11,961","11,132","1,608"
1,종로구,"1,772",813,0,0,210,150,1,261,85,9,200,43
2,중 구,"2,333",16,114,87,77,236,240,372,386,155,361,289
3,용산구,"2,383",34,71,234,125,221,298,351,125,307,617,0
4,성동구,"3,602",448,125,212,105,339,310,874,390,262,461,76

In [70]:
# cctv.columns[1:]

for column in cctv.columns[1:]:
    cctv[column] = cctv[column].apply(lambda x: int(x.replace(',','')))
cctv.head()

,구분,총계,2012년 이전,2012년,2013년,2014년,2015년,2016년,2017년,2018년,2019년,2020년,2021년
0,계,77032,7667,2200,3491,4439,6582,8129,9947,9876,11961,11132,1608
1,종로구,1772,813,0,0,210,150,1,261,85,9,200,43
2,중 구,2333,16,114,87,77,236,240,372,386,155,361,289
3,용산구,2383,34,71,234,125,221,298,351,125,307,617,0
4,성동구,3602,448,125,212,105,339,310,874,390,262,461,76

In [ ]:
# 멍